spec/fixtures/evt_charge_succeeded.json

{"id":"evt_18AsvnEDK3tRuRHOejxmbR9w","object":"event","api_version":"2016-03-07","created":1463194507,"data":{"object":{"id":"ch_18AsvnEDK3tRuRHOjWXnYjVa","object":"charge","amount":999,"amount_refunded":0,"application_fee":null,"balance_transaction":"txn_18AsvnEDK3tRuRHOPSYjoecI","captured":true,"created":1463194507,"currency":"usd","customer":"cus_8RmU9uUsmCqR1N","description":null,"destination":null,"dispute":null,"failure_code":null,"failure_message":null,"fraud_details":{},"invoice":"in_18AsvnEDK3tRuRHOs8rRAq9Z","livemode":false,"metadata":{},"order":null,"paid":true,"receipt_email":null,"receipt_number":null,"refunded":false,"refunds":{"object":"list","data":[],"has_more":false,"total_count":0,"url":"/v1/charges/ch_18AsvnEDK3tRuRHOjWXnYjVa/refunds"},"shipping":null,"source":{"id":"card_18AsvjEDK3tRuRHOLoFNGkzV","object":"card","address_city":null,"address_country":null,"address_line1":null,"address_line1_check":null,"address_line2":null,"address_state":null,"address_zip":null,"address_zip_check":null,"brand":"Visa","country":"US","customer":"cus_8RmU9uUsmCqR1N","cvc_check":"pass","dynamic_last4":null,"exp_month":5,"exp_year":2016,"fingerprint":"njjpAQzzTJCl3yl9","funding":"credit","last4":"4242","metadata":{},"name":null,"tokenization_method":null},"source_transfer":null,"statement_descriptor":null,"status":"succeeded"}},"livemode":false,"pending_webhooks":0,"request":"req_8RmUGRyBoAXeEK","type":"charge.succeeded"}
